{
	"basics": {
		"name": "Scott Maclure",
		"label": "Web Applications Architect",
		"email": "scott@maclure.com.au",
		"website": "http://scott.maclure.com.au/",
		"picture": "http://s.gravatar.com/avatar/09e4533fa7324c171453c9d5b301484e?s=100",
		"summary": "<p>I've loved working with the web since the earliest days of my profession. The open, rapid nature of development means the cost of experimenting is low. Risks can be taken. Agile excels here (scrum, kanban).</p><p> In recent years, I've appreciated the rise in focus on quality in the web stack, and recent advances with multi-device development (including native), which allows  for rich, consistent and fast user experiences.</p><p>In my current role as Applications Architect, I'm always excited by the continuous challenges and learning this industry demands, and working with my colleagues to implement customer-focused, pragmatic solutions. There's nothing more exciting than making people's lives easier through technology.</p>"
	},
	"skills": [
		{
			"name": "Web/Native Development",
			"level": "Expert",
			"keywords": [
				"JavaScript / ECMAScript 5,6+ (and jQuery)",
				"HTML(5), CSS(3)",
				"SCSS, Compass",
				"Cordova (hybrid native apps/pocs for Optus and Singtel)"
			]
		},
		{
			"name": "Test Tools",
			"level": "Accomplished",
			"keywords": [
				"Jasmine (and Jest)",
				"Istanbul",
				"Cucumber",
				"Webdriver.io",
				"JUnit"
			]
		},
		{
			"name": "Continuous Integration/Delivery",
			"level": "Accomplished",
			"keywords": [
				"GruntJS",
				"gulp",
				"Jenkins",
				"Sonar",
				"Maven",
				"Ant",
				"Conform"
			]
		},
		{
			"name": "Soft Skills",
			"level": "Accomplished",
			"keywords": [
				"Applications Architect",
				"Solution Designer",
				"Technical Lead",
				"Mentor",
				"Stakeholder Management",
				"Technical Interviewer"
			]
		},
		{
			"name": "Servers and Cloud Computing",
			"level": "Accomplished",
			"keywords": [
				"Linux (Debian, CentOS)",
				"AWS (EC2)"
			]
		},
		{
			"name": "JavaScript Frameworks",
			"level": "Expert",
			"keywords": [
				"BackboneJS, MarionetteJS",
				"AngularJS",
				"ReactJS",
				"BlazeJS",
				"RactiveJS",
				"BatmanJS"
			]
		},
		{
			"name": "Server-Side Technologies/Patterns",
			"level": "Accomplished",
			"keywords": [
				"NodeJS (ExpressJS, Action Hero)",
				"Java (Play 1.x)",
				"PHP4/5 (Shh)",
				"Ruby (Dashing.io)",
				"Clojure (learning)",
				"Bash/Fish scripting",
				"RESTful web services"
			]
		},
		{
			"name": "Content Management Systems (CMS)",
			"level": "Accomplished",
			"keywords": [
				"Vignette",
				"AEM",
				"Wordpress",
				"Drupal"
			]
		}
	],
	"work": [
		{
			"company": "Singtel Optus Pty Ltd",
			"position": "Application Architect",
			"website": "https://www.optus.com.au/",
			"startDate": "2015",
			"endDate": "Now",
			"summary": "",
			"highlights": [
				"Joined the online architecture team in April 2015, being invited by Martien Verbruggen (previous director) and Steven Bruce to continue work on the LUX initiative.",
				"Co-designer and core developer of LUX - the UX/UI layer intended for all current/future web projects at Optus.",
				"Responsible for producing and overseeing Impact Assessments - working with the business to produce the best solution for Optus and its customers.",
				"Solution Designer for the My Account project team - responsible for the overall technical implementation, and its delivery to production.",
				"Technical consultant for Singtel Spring project, working with Danny Guan (lead architect for Singtel's Spring project) to assist with technical integration of LUX."
			]
		},
		{
			"company": "Singtel Optus Pty Ltd",
			"position": "Senior Frontend Engineer",
			"website": "https://www.optus.com.au/",
			"startDate": "2011",
			"endDate": "2015",
			"endDate": "Now",
			"summary": "Frontend developer for optus.com.au, and various internal tools and projects.",
			"highlights": [
				"Member of Technical Lead group, focusing on improving best practice, onboarding and technology adoption.",
				"Designed FE technical test to give to prospective FE candidates.",
				"Extensive candidate interview experience for FE roles.",
				"Mentoring team members in TDD/BDD, design patterns and best practices.",
				"Worked on the 'Doorstep' website using Agile / OOP practices. Stack was jQuery, SASS and Play 1.x (groovy templating).",
				"Introduced FE automation via GruntJS, automating manual tasks and hooking that into Jenkins for CI.",
				"BDD advocate with Jasmine (and other tools) to the FE group.",
				"Worked on creating the 'Living Style Guide' as a generic style guide for optus web projects. Based on Foundation v4.",
				"Built the product catalogue admin tool using Backbone, Marionette, Foundation, Jasmine, Grunt and SCSS.",
				"Integrated code quality metrics with Istanbul and Sonar into our build process.",
				"Worked on an internal tool using AngularJS and Grunt.",
				"Participated in multiple Hackathons using various FE tools and tech.",
				"Created a 'Quality Dashboard' displaying realtime information from Jenkins and Sonar, using Dashing.io. Used to monitor test coverage, Sonar issues, and test automation results."
			]
		},
		{
			"company": "Scott Maclure Consulting",
			"position": "Web Applications Development",
			"website": "http://scott.maclure.com.au/",
			"startDate": "2005",
			"endDate": "Now",
			"summary": "Full-stack freelance developer. I work with various small businessess and governments to implement web applications. Main tech is PHP, MySQL, JavaScript, HTML, CSS.",
			"highlights": [
				"Built the grants application platform (<a href=\"http://www.arts.nsw.gov.au/\">link</a>) for Arts NSW at minimal cost compared to vendors. Based on Limesurvey, the platform allowed Arts to transition from a printed, PDF-centric application process to an online process, saving time and trees. Applications can be exported to PDF for record-keeping.",
				"Built the Sourced group website using nodejs, Backbone and SCSS/Compass - <a href=\"http://sourcedgroup.com.au/\">sourcedgroup.com.au</a>"
			]
		},
		{
			"company": "The Regional Institude / Cirql",
			"position": "Lead Developer",
			"website": "http://cirql.com/",
			"startDate": "2005",
			"endDate": "2011",
			"summary": "Lead a small team in the ongoing development of their publishing platform (PHP, MySQL, jQuery, YUI). Full stack, full lifecycle experience. Multiple client hosting, payment gateway integration, modules, wysiwyg editing/publishing features, etc.",
			"highlights": [
				"First exposure to AWS, which would have reduced their monthly bill to 1/5th current webhost (and with better specs).",
				"Built an online donation system for <a href=\"http://www.canoeclassic.asn.au/\">The Hawkesbury Canoe Classic</a>, which allowed them to increase their donations by a significant multiplier. I believe that around 2011, total donations received through the system over a few years was over 1 million.",
				"We designed a new 'race' module for this purpose, allowing entrants to setup a profile page that can accept donations through our payment system."
			]
		}
	],
	"education": [
		{
			"institution": "Software Education Pty Ltd",
			"area": "Agile Certification",
			"studyType": "Agile Programming Techniques",
			"startDate": "2014",
			"endDate": "2014",
			"gpa": "",
			"courses": []
		},
		{
			"institution": "University of Technology, Sydney",
			"area": "Science in Computing Science",
			"studyType": "Bachelor (Hons)",
			"startDate": "1998",
			"endDate": "2002",
			"gpa": "",
			"courses": []
		}
	],
	"languages": [
		{
			"language": "English",
			"fluency": "Native speaker"
		},
		{
			"language": "Indonesian",
			"fluency": "Ignorant tourist"
		}
	]
}